# IndexStreamLine Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexStreamLine Class
Members See Also
---
A stream that can be used to write IndexLine primitives into an IndexBuffer
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class IndexStreamLine : IndexStream
```

Visual Basic
---
```text
Public Class IndexStreamLine _
	Inherits IndexStream
```

Visual C++
---
```text
public ref class IndexStreamLine : public IndexStream
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.DirectContext3D..::..IndexStream Autodesk.Revit.DB.DirectContext3D..::..IndexStreamLine
# See Also
IndexStreamLine Members
Autodesk.Revit.DB.DirectContext3D Namespace